export const NOT_SELECTED = "선택 안 함";
export const POTENTIAL_CUBE = "잠재능력";
export const ADDITIONAL_POTENTIAL_CUBE = "에디셔널 잠재능력";

export const POTENTIAL_CUBE_COST = {
  "159": {
    레어: 4000000,
    에픽: 16000000,
    유니크: 34000000,
    레전드리: 40_000_000,
  },
  "199": {
    레어: 4_250_000,
    에픽: 17_000_000,
    유니크: 36_125_000,
    레전드리: 42_500_000,
  },
  "249": {
    레어: 4_500_000,
    에픽: 18_000_000,
    유니크: 38_250_000,
    레전드리: 45_000_000,
  },
  "300": {
    레어: 5_000_000,
    에픽: 20_000_000,
    유니크: 42_500_000,
    레전드리: 50_000_000,
  },
} as const;

export const ADDITIONAL_POTENTIAL_CUBE_COST = {
  "159": {
    레어: 9_750_000,
    에픽: 27_300_000,
    유니크: 66_300_000,
    레전드리: 78_000_000,
  },
  "199": {
    레어: 10_375_000,
    에픽: 29_050_000,
    유니크: 70_550_000,
    레전드리: 83_000_000,
  },
  "249": {
    레어: 11_000_000,
    에픽: 30_800_000,
    유니크: 74_800_000,
    레전드리: 88_000_000,
  },
  "300": {
    레어: 12_250_000,
    에픽: 34_300_000,
    유니크: 83_300_000,
    레전드리: 98_000_000,
  },
} as const;
